#### GetParameterGroupTypeId Method

---

|  |
| --- |
| ParameterUtils Class   See Also |

Gets the ForgeTypeId identifying the built-in parameter group corresponding to BuiltInParameterGroup value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GetParameterGroupTypeId( 	BuiltInParameterGroup builtInParamGroup ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetParameterGroupTypeId ( _ 	builtInParamGroup As BuiltInParameterGroup _ ) As ForgeTypeId ``` |

| Visual C++ |
| --- |
| ``` public: static ForgeTypeId^ GetParameterGroupTypeId( 	BuiltInParameterGroup builtInParamGroup ) ``` |

#### Parameters

builtInParamGroup
:   Type:  Autodesk.Revit.DB BuiltInParameterGroup
     The BuiltInParameterGroup value.

#### Return Value

Identifier of the parameter group corresponding to the given BuiltInParameterGroup value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ParameterUtils Class

Autodesk.Revit.DB Namespace